while True:                                                         #Постійний цикл
    a = input("Логін: ")                                            #Ввід в термінал
    b = input("Пароль: ")                                           #Ввід в термінал

    if a == "student1" and b == "1234":                             #Якщо а = "" і б = "":
        c = [12, 10, 8, 4, 7]                                       #List

    elif a == "student2" and b == "qwerty":                         #Або а = "" і б = "":
        c = [5, 6, 3, 4, 9]                                         #List

    elif a == "student3" and b == "abcd":                           #Або а = "" і б = "":
        c = [12, 11, 10, 8, 2]                                      #List

    elif a == "student4" and b == "pass123":                        #Або а = "" і б = "":
        c = [4, 3, 6, 8, 9]                                         #List

    else:                                                           #інакше
        print("Неправильний логін або пароль")                      #Функція
        print("Спробуйте ще раз")                                   #Функція
        continue                                                    #Пропустити інтеграцію та почати заново

    print("Оцінки:", c)                                             #Функція

    d = 0                                                           #Задовільні
    e = 0                                                           #Не задовільні
    f = 0                                                           #Номер перевірки

    while f < 5:                                                    #Інтеграція від 0 до 5
        if c[f] >= 5 and c[f] <= 12:                                #Якщо оцінка за Н >=5 і оцінка за Н <=12
            d = d + 1

        elif c[f] >= 1 and c[f] <= 4:                               #Якщо оцінка за Н >=1 і оцінка за Н <=4
            e = e + 1                                               #Зміна

        f = f + 1                                                   #Зміна

    print("Задовільних:", d)                                        #Функція
    print("Незадовільних:", e)                                      #Функція

    break                                                           #Стоп